app/views/books/_table.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 1]]
---
    </td>
    <td>コメント数：<%= book.comments.count %></td>