app/controllers/books_controller.rb

  def index
    @books = Book.all.sort { |a, b| b.favorite_users.count <=> a.favorite_users.count }
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]